Examples/ClassDiagram/Exports/typescript.dot
digraph Acai {
  rankdir=TB;
  compound=true;
  fontname="Helvetica";
  fontsize=12;
  node [shape=none margin=0 fontname="Helvetica" fontsize=12];
  edge [fontname="Helvetica" fontsize=10];
  "TypeScript.Library" [label=<<TABLE BORDER="1" CELLBORDER="0" CELLSPACING="0" CELLPADDING="4"><TR><TD ALIGN="CENTER"><B>Library</B></TD></TR><HR/><TR><TD ALIGN="LEFT">+ playlists: Playlist[]<BR ALIGN="LEFT"/></TD></TR><HR/><TR><TD ALIGN="LEFT">+ constructor(playlists: Playlist[])<BR ALIGN="LEFT"/>+ addPlaylist(playlist: Playlist): void<BR ALIGN="LEFT"/>+ playlist(named: string): Playlist | undefined<BR ALIGN="LEFT"/></TD></TR></TABLE>>];
  "TypeScript.MediaItem" [label=<<TABLE BORDER="1" CELLBORDER="0" CELLSPACING="0" CELLPADDING="4"><TR><TD ALIGN="CENTER"><B>MediaItem</B></TD></TR><HR/><TR><TD ALIGN="LEFT">+ title: string<BR ALIGN="LEFT"/>+ duration: number<BR ALIGN="LEFT"/>+ genre: Genre<BR ALIGN="LEFT"/></TD></TR><HR/><TR><TD ALIGN="LEFT">+ constructor(title: string, duration: number, genre: Genre)<BR ALIGN="LEFT"/>+ play(): void<BR ALIGN="LEFT"/></TD></TR></TABLE>>];
  "TypeScript.Playable" [label=<<TABLE BORDER="1" CELLBORDER="0" CELLSPACING="0" CELLPADDING="4"><TR><TD ALIGN="CENTER"><FONT POINT-SIZE="10">&lt;&lt;interface&gt;&gt;</FONT><BR/><B>Playable</B></TD></TR><HR/><TR><TD ALIGN="LEFT">+ title: string<BR ALIGN="LEFT"/>+ duration: number<BR ALIGN="LEFT"/></TD></TR><HR/><TR><TD ALIGN="LEFT">+ play(): void<BR ALIGN="LEFT"/></TD></TR></TABLE>>];
  "TypeScript.Genre" [label=<<TABLE BORDER="1" CELLBORDER="0" CELLSPACING="0" CELLPADDING="4"><TR><TD ALIGN="CENTER"><FONT POINT-SIZE="10">&lt;&lt;enumeration&gt;&gt;</FONT><BR/><B>Genre</B></TD></TR><HR/><TR><TD ALIGN="LEFT"> </TD></TR><HR/><TR><TD ALIGN="LEFT"> </TD></TR><HR/><TR><TD ALIGN="LEFT">Pop<BR ALIGN="LEFT"/>Rock<BR ALIGN="LEFT"/>Jazz<BR ALIGN="LEFT"/>Classical<BR ALIGN="LEFT"/>Electronic<BR ALIGN="LEFT"/>SpokenWord<BR ALIGN="LEFT"/></TD></TR></TABLE>>];
  "TypeScript.Player" [label=<<TABLE BORDER="1" CELLBORDER="0" CELLSPACING="0" CELLPADDING="4"><TR><TD ALIGN="CENTER"><B>Player</B></TD></TR><HR/><TR><TD ALIGN="LEFT">- nowPlaying: Playable | null<BR ALIGN="LEFT"/>- library: Library<BR ALIGN="LEFT"/></TD></TR><HR/><TR><TD ALIGN="LEFT">+ constructor(library: Library)<BR ALIGN="LEFT"/>+ play(item: Playable): void<BR ALIGN="LEFT"/>+ playFirstItem(playlistNamed: string): void<BR ALIGN="LEFT"/></TD></TR></TABLE>>];
  "TypeScript.Playlist" [label=<<TABLE BORDER="1" CELLBORDER="0" CELLSPACING="0" CELLPADDING="4"><TR><TD ALIGN="CENTER"><B>Playlist</B></TD></TR><HR/><TR><TD ALIGN="LEFT">+ name: string<BR ALIGN="LEFT"/>+ items: MediaItem[]<BR ALIGN="LEFT"/>+ totalDuration: number<BR ALIGN="LEFT"/></TD></TR><HR/><TR><TD ALIGN="LEFT">+ constructor(name: string, items: MediaItem[])<BR ALIGN="LEFT"/>+ add(item: MediaItem): void<BR ALIGN="LEFT"/></TD></TR></TABLE>>];
  "TypeScript.Podcast" [label=<<TABLE BORDER="1" CELLBORDER="0" CELLSPACING="0" CELLPADDING="4"><TR><TD ALIGN="CENTER"><B>Podcast</B></TD></TR><HR/><TR><TD ALIGN="LEFT">+ host: string<BR ALIGN="LEFT"/>+ episodeNumber: number<BR ALIGN="LEFT"/></TD></TR><HR/><TR><TD ALIGN="LEFT">+ constructor(title: string, duration: number, host: string, episodeNumber: number)<BR ALIGN="LEFT"/>+ play(): void<BR ALIGN="LEFT"/></TD></TR></TABLE>>];
  "TypeScript.Song" [label=<<TABLE BORDER="1" CELLBORDER="0" CELLSPACING="0" CELLPADDING="4"><TR><TD ALIGN="CENTER"><B>Song</B></TD></TR><HR/><TR><TD ALIGN="LEFT">+ artist: string<BR ALIGN="LEFT"/>+ album: string<BR ALIGN="LEFT"/></TD></TR><HR/><TR><TD ALIGN="LEFT">+ constructor(title: string, duration: number, genre: Genre, artist: string, album: string?)<BR ALIGN="LEFT"/>+ play(): void<BR ALIGN="LEFT"/></TD></TR></TABLE>>];
  "TypeScript.MediaItem" -> "TypeScript.Playable" [arrowhead=empty style=dashed];
  "TypeScript.Podcast" -> "TypeScript.MediaItem" [arrowhead=empty style=solid];
  "TypeScript.Song" -> "TypeScript.MediaItem" [arrowhead=empty style=solid];
  "TypeScript.Library" -> "TypeScript.Playlist" [dir=back arrowtail=odiamond label="playlists" headlabel="*"];
  "TypeScript.MediaItem" -> "TypeScript.Genre" [dir=back arrowtail=diamond label="genre" headlabel="1"];
  "TypeScript.Player" -> "TypeScript.Library" [dir=back arrowtail=diamond label="library" headlabel="1"];
  "TypeScript.Player" -> "TypeScript.Playable" [arrowhead=vee style=dashed];
  "TypeScript.Playlist" -> "TypeScript.MediaItem" [dir=back arrowtail=odiamond label="items" headlabel="*"];
  "TypeScript.Song" -> "TypeScript.Genre" [arrowhead=vee style=dashed];
}
